In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'state':['서울','서울','서울','부산','부산','부산'],
'year':[2014, 2016, 2018, 2014, 2016, 2018],
'pop':[997.5, 984.3, 970.5, 345.2, 344.7, 340.0]}
data

{'state': ['서울', '서울', '서울', '부산', '부산', '부산'],
 'year': [2014, 2016, 2018, 2014, 2016, 2018],
 'pop': [997.5, 984.3, 970.5, 345.2, 344.7, 340.0]}

In [3]:
df=pd.DataFrame(data)
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [4]:
df.to_csv('예제.csv', encoding = 'cp949', index = False)

In [5]:
pd.read_csv('예제.csv', encoding = 'cp949')

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [6]:
list(df.index)

[0, 1, 2, 3, 4, 5]

In [7]:
list(df.columns)

['state', 'year', 'pop']

In [8]:
df.values

array([['서울', 2014, 997.5],
       ['서울', 2016, 984.3],
       ['서울', 2018, 970.5],
       ['부산', 2014, 345.2],
       ['부산', 2016, 344.7],
       ['부산', 2018, 340.0]], dtype=object)

In [9]:
titanic = pd.read_csv('titanic.csv')
list(titanic.columns)

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [10]:
df.shape

(6, 3)

In [11]:
df.shape[0]

6

In [12]:
df.shape[1]

3

In [13]:
df.dtypes

state     object
year       int64
pop      float64
dtype: object

In [14]:
df.year = df.year.astype('object')

In [15]:
df.dtypes

state     object
year      object
pop      float64
dtype: object

In [16]:
df.iloc[5] = [np.nan, np.nan, np.nan]

In [17]:
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5   NaN   NaN    NaN

In [18]:
len(df)

6

In [19]:
df.count()

state    5
year     5
pop      5
dtype: int64

In [20]:
df.size

18

In [21]:
df.head(3)

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5

In [22]:
df.tail(3)

  state  year    pop
3    부산  2014  345.2
4    부산  2016  344.7
5   NaN   NaN    NaN

In [23]:
df.describe()

              pop
count    5.000000
mean   728.440000
std    350.207064
min    344.700000
25%    345.200000
50%    970.500000
75%    984.300000
max    997.500000

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   5 non-null      object
 1   year    5 non-null      object
 2   pop     5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 272.0+ bytes

In [25]:
df.state

0     서울
1     서울
2     서울
3     부산
4     부산
5    NaN
Name: state, dtype: object

In [26]:
df['state']

0     서울
1     서울
2     서울
3     부산
4     부산
5    NaN
Name: state, dtype: object

In [27]:
df[['state']]

  state
0    서울
1    서울
2    서울
3    부산
4    부산
5   NaN

In [28]:
df['pop']

0    997.5
1    984.3
2    970.5
3    345.2
4    344.7
5      NaN
Name: pop, dtype: float64

In [29]:
df['state'].value_counts()

서울    3
부산    2
Name: state, dtype: int64

In [30]:
df['pop'].unique()

array([997.5, 984.3, 970.5, 345.2, 344.7,   nan])

In [31]:
df['pop'].nunique()

5

In [32]:
df['pop'].unique()

array([997.5, 984.3, 970.5, 345.2, 344.7,   nan])

In [36]:
ta = titanic.Age.value_counts()
ta.index[0]

24.0

In [37]:
titanic.Age.value_counts().index[0]

24.0

In [38]:
df.min()

year    2014.0
pop      344.7
dtype: float64

In [40]:
df.quantile(0.5)

pop    970.5
Name: 0.5, dtype: float64

In [41]:
df.quantile(0.25)

pop    345.2
Name: 0.25, dtype: float64

In [43]:
dx = df.copy()
display(dx)

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5   NaN   NaN    NaN

In [44]:
dy = dx
dx.iloc[1,1] = pd.NA
display(dx)
display(dy)
display(df)

  state  year    pop
0    서울  2014  997.5
1    서울  <NA>  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5   NaN   NaN    NaN

  state  year    pop
0    서울  2014  997.5
1    서울  <NA>  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5   NaN   NaN    NaN

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5   NaN   NaN    NaN

In [46]:
%whos

Variable   Type         Data/Info
---------------------------------
data       dict         n=3
df         DataFrame      state  year    pop\n0  <...>4.7\n5   NaN   NaN    NaN
dx         DataFrame      state  year    pop\n0  <...>4.7\n5   NaN   NaN    NaN
dy         DataFrame      state  year    pop\n0  <...>4.7\n5   NaN   NaN    NaN
np         module       <module 'numpy' from 'C:\<...>ges\\numpy\\__init__.py'>
pd         module       <module 'pandas' from 'C:<...>es\\pandas\\__init__.py'>
ta         Series       24.00    30\n22.00    27\<...> Length: 88, dtype: int64
titanic    DataFrame         PassengerId  Survive<...>\n[891 rows x 12 columns]

In [47]:
df.iloc[0]

state       서울
year      2014
pop      997.5
Name: 0, dtype: object

In [48]:
df.loc[0]

state       서울
year      2014
pop      997.5
Name: 0, dtype: object

In [49]:
df.iloc[0,:]

state       서울
year      2014
pop      997.5
Name: 0, dtype: object

In [50]:
df.loc[:1] #label 1번까지

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3

In [51]:
df.iloc[:1] #index1 까지

  state  year    pop
0    서울  2014  997.5

In [52]:
df.loc[:,'state']

0     서울
1     서울
2     서울
3     부산
4     부산
5    NaN
Name: state, dtype: object

In [53]:
df.iloc[:,0]

0     서울
1     서울
2     서울
3     부산
4     부산
5    NaN
Name: state, dtype: object

In [54]:
df.state

0     서울
1     서울
2     서울
3     부산
4     부산
5    NaN
Name: state, dtype: object

In [55]:
df['state']

0     서울
1     서울
2     서울
3     부산
4     부산
5    NaN
Name: state, dtype: object

In [56]:
df.loc[:,'state':'pop']

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5   NaN   NaN    NaN

In [57]:
df.loc[0:2, ['state', 'year']]

  state  year
0    서울  2014
1    서울  2016
2    서울  2018

In [58]:
df['pop']>500

0     True
1     True
2     True
3    False
4    False
5    False
Name: pop, dtype: bool

In [59]:
df[df['pop']>500]

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5

In [60]:
df['pop'].isin([997.5, 984.3])

0     True
1     True
2    False
3    False
4    False
5    False
Name: pop, dtype: bool

In [61]:
df[df['pop'].isin([997.5, 984.3])]

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3

In [62]:
df.query('pop > 500')

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5

In [63]:
df.query('year in [2014, 2016] and state == "부산"')

  state  year    pop
3    부산  2014  345.2
4    부산  2016  344.7

In [65]:
df.query('state == "부산"')

  state  year    pop
3    부산  2014  345.2
4    부산  2016  344.7

In [67]:
k = df['pop'].value_counts().index[0]
df.query('pop == @k')

  state  year    pop
4    부산  2016  344.7

In [68]:
df3 = pd.DataFrame({'Ikey':['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df4 = pd.DataFrame({'rkey':['a','b', 'd'], 'data2': range(3)})
df5 = pd.merge(df3, df4, left_on='Ikey', right_on='rkey', how='outer')
df5

  Ikey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

In [69]:
display(df5.isnull())

    Ikey  data1   rkey  data2
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False
6  False  False   True   True
7   True   True  False  False

In [70]:
df5.isnull().sum()

Ikey     1
data1    1
rkey     1
data2    1
dtype: int64

In [71]:
df5.dropna(how='any') #NaN값이 하나라도 있으면 해당 열 제거

  Ikey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0

In [72]:
df5.dropna(how='all') #한 열이 모두 NaN값일 때 제거

  Ikey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

In [74]:
df5.iloc[6] = [np.nan, np.nan, np.nan, np.nan] #label=6
df5

  Ikey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6  NaN    NaN  NaN    NaN
7  NaN    NaN    d    2.0

In [75]:
df5.dropna(how='all')

  Ikey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
7  NaN    NaN    d    2.0

In [76]:
df5.dropna(how='all').reset_index(drop=True)

  Ikey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6  NaN    NaN    d    2.0

In [77]:
df5.fillna(-1) #NaN -> -1

  Ikey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6   -1   -1.0   -1   -1.0
7   -1   -1.0    d    2.0

In [78]:
df5.fillna({'data1':1.5, 'data2':0.5, 'Ikey':'Y', 'rkey':'a'})

  Ikey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    Y    1.5    a    0.5
7    Y    1.5    d    2.0

In [80]:
df5.fillna(method='ffill') #NaN -> 주변값(이전)으로 치환

  Ikey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    a    5.0    a    0.0
7    a    5.0    d    2.0

In [81]:
df5.fillna(method='bfill') #NaN -> 주변값(이후)으로 치환

  Ikey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6  NaN    NaN    d    2.0
7  NaN    NaN    d    2.0